---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.SweepProfile
source: html/1918f6b7-7c78-4b3d-9d2b-3030d4504550.htm
---
# SweepProfile Members

Causes the object to release immediately any resources it may be utilizing.